Revit 2016 API
BuiltInFailures.StructuralConnectionFailures Properties
The BuiltInFailures.StructuralConnectionFailures type exposes the following members.
Properties
Name | Description
StructuralConnectionCannotGenerate
 Could not create Structural Connection Handler
StructuralConnectionNotEnoughRefs
 Structural Connection Handler cannot connect fewer than two elements.
StructuralConnectionTooFarNotEnoughRefs
 Structural Connection Handler cannot connect too far elements
StructuralConnectionTooFarRefs
 Structural Connection Handler cannot connect too far elements
See Also
BuiltInFailures.StructuralConnectionFailures Class
Autodesk.Revit.DB Namespace